gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
/**
 * @file watchdog.c
 * @author Gian Barta-Dougall ()
 * @brief
 * @version 0.1
 * @date 2023-07-03
 *
 * @copyright Copyright (c) 2023
 *
 */

/* C Library Includes */
#include <stdarg.h>

/* STM32 Library Includes */
#include "usb_device.h"
#include "usbd_cdc_if.h"

/* Personal Includes */
#include "watchdog.h"
#include "event_group.h"
#include "datetime.h"
#include "utils.h"
#include "hardware_config.h"
#include "gpio.h"
#include "task_scheduler.h"
#include "task_scheduler_config.h"
#include "stm32_uart.h"
#include "log_usb.h"
#include "bpacket.h"
#include "comms_stm32.h"
#include "rtc_mcp7940n.h"
#include "watchdog_utils.h"
#include "ds18b20.h"
#include "integer.h"
#include "float.h"
#include "event_timeout_stm.h"

/* Private Enums */

/* Private Macros */
#define WD_FLASH_SETTINGS_START_ADDRESS 0x0803F800
#define WD_FLASH_SETTINGS_END_ADDRESS   0x0803F8BC

/* Public Variables */
event_group_t gbl_EventsStm, gbl_EventsEsp;
et_timeout_t lg_Timeouts;

/* Private Variables */
capture_time_t gbl_CaptureTime;
camera_settings_t lg_CameraSettings;

ds18b20_t Ds18b20 = {
    .rom  = DS18B20_ROM_1,
    .temp = 0,
};

char errorMsg[150];

/* Function Prototypes */
uint8_t usb_read_packet(bpk_t* Bpacket);
uint8_t wd_request_photo_capture(uint8_t errorCode[1]);

uint8_t wd_write_settings(capture_time_t* CaptureTime, camera_settings_t* CameraSettings);
void wd_read_settings(capture_time_t* CaptureTime, camera_settings_t* CameraSettings);

void wd_handle_esp_response(bpk_t* Bpacket);
void wd_handle_maple_request(bpk_t* Bpacket);
void wd_write_bpacket_maple(bpk_t* Bpacket);
void wd_write_bpacket_esp(bpk_t* Bpacket);
uint8_t wd_calculate_next_alarm_time(dt_datetime_t* AlarmDatetime);

void wd_handle_timeouts(void) {

    bpk_t BpkStm32Response;

    if (et_timeout_has_occured(&lg_Timeouts, EVENT_ESP_TAKE_PHOTO) == TRUE) {

        if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_STM_REQUEST) == FALSE) {
            bpk_create_sp(&BpkStm32Response, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Message,
                          BPK_Code_Success, "ESP Take photo Timed out");
            wd_write_bpacket_maple(&BpkStm32Response);
        } else {
            log_usb_error("ESP Take photo timeout occured!\r\n");
        }

        // Clear all necessary event bits
        et_clear_timeout(&lg_Timeouts, EVENT_ESP_TAKE_PHOTO);
        event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_ACTIVE);
        event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_STM_REQUEST);
        event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_EVENT_RUNNING);
    }
}

void wd_error_handler_2(char* format, ...) {

    static char msg[100];
    va_list args;
    va_start(args, format);
    vsprintf(msg, format, args);
    va_end(args);

    while (1) {
        GPIO_TOGGLE(LED_RED_PORT, LED_RED_PIN);
        log_usb_error(msg);
        HAL_Delay(1000);
    }
}

void wd_error_handler1(char* fileName, uint32_t lineNumber, uint8_t code) {

    while (1) {
        GPIO_TOGGLE(LED_RED_PORT, LED_RED_PIN);
        log_usb_error("Error in %s on line %i. Code: %i\r\n", fileName, lineNumber, code);
        HAL_Delay(1000);
    }
}

void wd_esp_turn_on(void) {
    GPIO_SET_LOW(ESP32_POWER_PORT, ESP32_POWER_PIN);

    // Set the event bit to signify the ESP now has power
    event_group_set_bit(&gbl_EventsEsp, EVENT_ESP_ON, EGT_ACTIVE);

    // TODO: Enable the interrupt on the UART line for the ESP32
    HAL_NVIC_EnableIRQ(UART_ESP32_IRQn);

    /* Start timeout for ping */

    /* ###### START DEBUGGING BLOCK ###### */
    // Description:
    // log_usb_message("ESP now on");
    /* ####### END DEBUGGING BLOCK ####### */
}

void wd_esp_turn_off(void) {

    // Disable the initerrupt on the UART line for the ESP32
    HAL_NVIC_DisableIRQ(UART_ESP32_IRQn);

    GPIO_SET_HIGH(ESP32_POWER_PORT, ESP32_POWER_PIN);

    // Clear the esp ready and on flags
    event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_ON, EGT_ACTIVE);
    event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_READY, EGT_ACTIVE);

    /* ###### START DEBUGGING BLOCK ###### */
    // Description:
    // log_usb_message("ESP now off");
    /* ####### END DEBUGGING BLOCK ####### */
}

void alarm_test() {
    /****** START CODE BLOCK ******/
    // Description: Testing. Can delete when finished with it
    dt_datetime_t AlarmDatetime;
    // rtc_set_alarm(&AlarmDatetime);
    // rtc_enable_alarm();
    dt_datetime_t RtcDatetime = {
        .Time.second = 0,
        .Time.minute = 0,
        .Time.hour   = 0,
        .Date.day    = 14,
        .Date.month  = 7,
        .Date.year   = 2023,
    };
    rtc_write_datetime(&RtcDatetime);

    dt_datetime_init(&gbl_CaptureTime.Start, 0, 0, 9, 1, 1, 2023);
    dt_datetime_init(&gbl_CaptureTime.End, 0, 30, 15, 1, 1, 2030);
    gbl_CaptureTime.intervalSecond = 1;
    gbl_CaptureTime.intervalMinute = 0;
    gbl_CaptureTime.intervalHour   = 0;
    gbl_CaptureTime.intervalDay    = 1;

    AlarmDatetime.Date.day   = gbl_CaptureTime.Start.Date.day;
    AlarmDatetime.Date.month = gbl_CaptureTime.Start.Date.month;
    AlarmDatetime.Date.year  = gbl_CaptureTime.Start.Date.year;
    HAL_Delay(2000);
    int i = 0;
    while (i < 40) {
        wd_calculate_next_alarm_time(&AlarmDatetime);

        log_usb_message("New alarm: %i:%i:%i %i/%i/%i\r\n", AlarmDatetime.Time.second, AlarmDatetime.Time.minute,
                        AlarmDatetime.Time.hour, AlarmDatetime.Date.day, AlarmDatetime.Date.month,
                        AlarmDatetime.Date.year);

        rtc_write_datetime(&AlarmDatetime);
        i++;
    }

    while (1) {}
    /****** END CODE BLOCK ******/
}

void main_sleep_test(void) {

    hardware_clock_config();
    hardware_config_init();

    // Disable ESP interrupt
    HAL_NVIC_DisableIRQ(UART_ESP32_IRQn);

    HAL_Delay(3000);
    uint8_t code = rtc_init();
    if (code != TRUE) {
        wd_error_handler1(__FILE__, __LINE__, code);
    }

    // Read the watchdog settings from flash
    wd_read_settings(&gbl_CaptureTime, &lg_CameraSettings);

    /* Confirm the settings are valid */
    uint8_t errorFound = FALSE;

    /* TODO: Check the rest of the values */

    if (lg_CameraSettings.frameSize > WD_CR_UXGA_1600x1200) {
        lg_CameraSettings.frameSize = WD_CR_UXGA_1600x1200;
        errorFound                  = TRUE;
    }

    if (lg_CameraSettings.jpegCompression > 63) {
        lg_CameraSettings.jpegCompression = 8;
        errorFound                        = TRUE;
    }

    if (errorFound) {
        wd_write_settings(&gbl_CaptureTime, &lg_CameraSettings);
    }

