gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
    /* Confirm the start, end and interval times are valid */
    if (dt_time_is_valid(&gbl_CaptureTime.Start.Time) != TRUE) {
        sprintf(errorMsg, "Error %s on line %i. Time: %i:%i:%i\r\n", __FILE__, __LINE__,
                gbl_CaptureTime.Start.Time.second, gbl_CaptureTime.Start.Time.minute, gbl_CaptureTime.Start.Time.hour);
        // wd_error_handler_2(errorMsg);
    }

    if (dt_time_is_valid(&gbl_CaptureTime.End.Time) != TRUE) {
        sprintf(errorMsg, "Error %s on line %i. Time: %i:%i:%i\r\n", __FILE__, __LINE__,
                gbl_CaptureTime.End.Time.second, gbl_CaptureTime.End.Time.minute, gbl_CaptureTime.End.Time.hour);
        // wd_error_handler_2(errorMsg);
    }

    dt_datetime_t AlarmTime1;
    wd_calculate_next_alarm_time(&AlarmTime1);
    if (rtc_set_alarm(&AlarmTime1) != TRUE) {
        wd_error_handler(__FILE__, __LINE__);
    }
    if (rtc_enable_alarm() != TRUE) {
        wd_error_handler(__FILE__, __LINE__);
    }

    dt_datetime_t Rtc;
    if (rtc_read_datetime(&Rtc) != TRUE) {
        wd_error_handler(__FILE__, __LINE__);
    }
    log_usb_message("RTC Time: %i:%i:%i %i/%i/%i\r\n", Rtc.Time.second, Rtc.Time.minute, Rtc.Time.hour, Rtc.Date.day,
                    Rtc.Date.month, Rtc.Date.year);
    log_usb_message("Alarm time set to: %i:%i:%i %i/%i/%i\r\n", AlarmTime1.Time.second, AlarmTime1.Time.minute,
                    AlarmTime1.Time.hour, AlarmTime1.Date.day, AlarmTime1.Date.month, AlarmTime1.Date.year);

    while (1) {

        // Led on
        GPIO_SET_LOW(LED_GREEN_PORT, LED_GREEN_PIN);

        /* Disable USB */
        usb_denit();

        // Disable HAL tick
        HAL_SuspendTick();
        HAL_PWR_EnterSTOPMode(PWR_MAINREGULATOR_ON, PWR_SLEEPENTRY_WFI);

        // Device now in sleep mode. Wakes up by interrupt from RTC
        HAL_Init();
        hardware_clock_config();
        hardware_config_init();

        // HAL_ResumeTick();
        uint8_t i = 0;
        while (i < 5) {
            GPIO_TOGGLE(LED_GREEN_PORT, LED_GREEN_PIN);
            HAL_Delay(1000);
            i++;
        }

        while (1) {
            log_usb_message("Hello!\r\n");
            HAL_Delay(1000);
        }
        // dt_datetime_t Rtc;
        // if (rtc_read_datetime(&Rtc) != TRUE) {
        //     GPIO_SET_HIGH(LED_RED_PORT, LED_RED_PIN);
        //     log_usb_message("Error reading RTC\r\n");
        //     HAL_Delay(1000);
        // }
        // while (1) {

        //     log_usb_message("RTC Time: %i:%i:%i %i/%i/%i\r\n", Rtc.Time.second, Rtc.Time.minute, Rtc.Time.hour,
        //                     Rtc.Date.day, Rtc.Date.month, Rtc.Date.year);
        //     HAL_Delay(1000);
        // }
    }
}

void wd_start(void) {

    // Initialise all the hardware
    hardware_clock_config();
    hardware_config_init();

    /* Initialise software */
    uart_init();    // Initialise COMMS with the esp32
    ds18b20_init(); // Initialise the temperature sensor

    // TODO: Change the task scheduler timer. TIM15 is used for the ds18b20 so it cannot
    // be used for the task scheduler. Will need to find a different one. Reenable timer
    // in hardware config.c as I commented it out
    // task_scheduler_init(); // Reset Recipes list

    uint8_t code = rtc_init();
    if (code != TRUE) {
        wd_error_handler1(__FILE__, __LINE__, code);
    }

    // Read the watchdog settings from flash
    wd_read_settings(&gbl_CaptureTime, &lg_CameraSettings);

    /* Confirm the settings are valid */
    uint8_t errorFound = FALSE;

    /* TODO: Check the rest of the values */

    if (lg_CameraSettings.frameSize > WD_CR_UXGA_1600x1200) {
        lg_CameraSettings.frameSize = WD_CR_UXGA_1600x1200;
        errorFound                  = TRUE;
    }

    if (lg_CameraSettings.jpegCompression > 63) {
        lg_CameraSettings.jpegCompression = 8;
        errorFound                        = TRUE;
    }

    if (errorFound) {
        wd_write_settings(&gbl_CaptureTime, &lg_CameraSettings);
    }

    /* Confirm the start, end and interval times are valid */
    if (dt_time_is_valid(&gbl_CaptureTime.Start.Time) != TRUE) {
        sprintf(errorMsg, "Error %s on line %i. Time: %i:%i:%i\r\n", __FILE__, __LINE__,
                gbl_CaptureTime.Start.Time.second, gbl_CaptureTime.Start.Time.minute, gbl_CaptureTime.Start.Time.hour);
        // wd_error_handler_2(errorMsg);
    }

    if (dt_time_is_valid(&gbl_CaptureTime.End.Time) != TRUE) {
        sprintf(errorMsg, "Error %s on line %i. Time: %i:%i:%i\r\n", __FILE__, __LINE__,
                gbl_CaptureTime.End.Time.second, gbl_CaptureTime.End.Time.minute, gbl_CaptureTime.End.Time.hour);
        // wd_error_handler_2(errorMsg);
    }

    /* ###### START DEBUGGING BLOCK ###### */
    // Description:
    log_usb_message("Start time: %i:%i:%i %i/%i/%i\r\n", gbl_CaptureTime.Start.Time.second,
                    gbl_CaptureTime.Start.Time.minute, gbl_CaptureTime.Start.Time.hour, gbl_CaptureTime.Start.Date.day,
                    gbl_CaptureTime.Start.Date.month, gbl_CaptureTime.Start.Date.year);
    log_usb_message("End time: %i:%i:%i %i/%i/%i\r\n", gbl_CaptureTime.End.Time.second, gbl_CaptureTime.End.Time.minute,
                    gbl_CaptureTime.End.Time.hour, gbl_CaptureTime.End.Date.day, gbl_CaptureTime.End.Date.month,
                    gbl_CaptureTime.End.Date.year);
    log_usb_message("Interval: sec: %i min: %i hour: %i day: %i\r\n", gbl_CaptureTime.intervalSecond,
                    gbl_CaptureTime.intervalMinute, gbl_CaptureTime.intervalHour, gbl_CaptureTime.intervalDay);

    dt_datetime_t Rtc;
    if (rtc_read_datetime(&Rtc) != TRUE) {
        wd_error_handler(__FILE__, __LINE__);
    }
    log_usb_message("RTC Time: %i:%i:%i %i/%i/%i\r\n", Rtc.Time.second, Rtc.Time.minute, Rtc.Time.hour, Rtc.Date.day,
                    Rtc.Date.month, Rtc.Date.year);

    /* Calculate when the next alarm should be and set the RTC alarm for that */

    // dt_datetime_t AlarmTime1;
    // wd_calculate_next_alarm_time(&AlarmTime1);
    // rtc_set_alarm(&AlarmTime1);
    // rtc_enable_alarm();

