gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
    /* ###### START DEBUGGING BLOCK ###### */
    // Description:
    // log_usb_message("Alarm time set to: %i:%i:%i %i/%i/%i\r\n", AlarmTime1.Time.second, AlarmTime1.Time.minute,
    //                 AlarmTime1.Time.hour, AlarmTime1.Date.day, AlarmTime1.Date.month, AlarmTime1.Date.year);
    /* ####### END DEBUGGING BLOCK ####### */

    // Initialise event groups
    event_group_clear(&gbl_EventsStm);
    event_group_clear(&gbl_EventsEsp);

    // Set bit to update the rtc alarm
    event_group_set_bit(&gbl_EventsStm, EVENT_STM_RTC_UPDATE_ALARM, EGT_ACTIVE);

    /* DEBUGGING PURPOSES I HAVE COMMENTED THIS OUT BUT YOU WILL NEED TO COMMENT IT BACK IN*/
    // Set flag 'take photo' flag. In main loop below, STM32 will request ESP to
    // take a photo if this flag has been set. Getting ESP32 to take a photo on
    // startup to ensure the system is working correctly
    // event_group_set_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_ACTIVE);
    // event_group_set_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_STM_REQUEST);

    // Set flag 'system initialising' flag. In main loop where stm32 waits for
    // responses back from the ESP, if it gets a response saying a photo was taken
    // and the system init flag has been set then it knows that the photo was a test
    // photo as this flag is only set once on startup. The STM32 can then blink an
    // led to let the user know that the system has been initialised

    /****** START CODE BLOCK ******/
    // Description: This will need to be recommented back in but just checking if this is what is causing the bug
    // event_group_set_bit(&gbl_EventsStm, EVENT_STM_SYSTEM_INITIALISING, EGT_ACTIVE);
    /****** END CODE BLOCK ******/

    // Enter main loop
    bpk_t BpkEspResponse, MapleBpacket;
    uint8_t lastRTCSecond = 0;

    while (1) {

        /* Turn the ESP on or off depending on if there are esp tasks that need to occur */

        // The conditions the ESP should turn on are
        uint8_t espTurnOn = FALSE;
        if ((event_group_get_bits(&gbl_EventsEsp, EGT_ACTIVE) &
             ~((0x01 << EVENT_ESP_ON) | (0x01 << EVENT_ESP_READY))) != 0) {
            espTurnOn = TRUE;
        }

        /* When the USB is connected, the ESP32 should turn on and be ready for any commands
            request by the computer */
        if (GPIO_PIN_IS_HIGH(USBC_CONN_PORT, USBC_CONN_PIN)) {
            espTurnOn = TRUE;
        }

        // Check if there are any esp flags that are set that are not ESP_ON or ESP_READY
        if (espTurnOn) {

            // There is an esp event that needs to occur. Ensure the ESP has been turned on
            if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_ON, EGT_ACTIVE) != TRUE) {
                wd_esp_turn_on();
            }
        } else {

            /* ###### START DEBUGGING BLOCK ###### */
            // Description: For testing purposes I have removed the condition that the ESP will
            // always be on when USB C is connected
            // There are no pending esp events. Turn the ESP off if it is not already off
            // if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_ON, EGT_ACTIVE) == TRUE) {
            //     wd_esp_turn_off();
            // }
            /* ####### END DEBUGGING BLOCK ####### */

            // Only turn the ESP off is the USB is not connected
            if (GPIO_PIN_IS_HIGH(USBC_CONN_PORT, USBC_CONN_PIN) == FALSE) {
                // There are no pending esp events. Turn the ESP off if it is not already off
                if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_ON, EGT_ACTIVE) == TRUE) {
                    wd_esp_turn_off();
                }
            }
        }

        /* Put the STM32 to sleep if required */
        if (event_group_poll_bit(&gbl_EventsStm, EVENT_STM_SLEEP, EGT_ACTIVE) == TRUE) {
            event_group_clear_bit(&gbl_EventsStm, EVENT_STM_SLEEP, EGT_ACTIVE);

            /* ###### START DEBUGGING BLOCK ###### */
            // Description:
            log_usb_message("Putting STM32 to sleep\r\n");

            // Just so I know if the STM has gone to sleep
            GPIO_SET_HIGH(LED_RED_PORT, LED_RED_PIN);

            // This won't be needed here for the full thing and is just here for testing
            usb_denit();
            /* ####### END DEBUGGING BLOCK ####### */

            // Disable HAL tick
            HAL_SuspendTick();
            HAL_PWR_EnterSTOPMode(PWR_MAINREGULATOR_ON, PWR_SLEEPENTRY_WFI);

            // Device now in sleep mode. Wakes up by interrupt from RTC
            HAL_Init();
            hardware_clock_config();
            hardware_config_init();

            GPIO_SET_LOW(LED_RED_PORT, LED_RED_PIN);
            /* ###### START DEBUGGING BLOCK ###### */
            // Description: Just for debugging. Can remove when not required
            // Delay for a bit to give time to plug USBC back in to see the message
            uint8_t i = 0;
            while (i < 30) {
                GPIO_TOGGLE(LED_GREEN_PORT, LED_GREEN_PIN);
                HAL_Delay(1000);
                i++;
            }
            log_usb_message("STM woken back up\r\n");
            /* ####### END DEBUGGING BLOCK ####### */
        }

        /* Request ESP32 to take a photo if the 'take photo' flag has been set */
        if ((event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_ACTIVE) == TRUE) &&
            (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_EVENT_RUNNING) == FALSE)) {

            // Don't request a photo until the ESP is in the ready state. The ESP takes
            // a second or two to startup after it has been turned on. The ESP_READY flag
            // will be set automatically by the STM when the ESP is ready to receive commands
            if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_READY, EGT_ACTIVE) == TRUE) {
                event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_ACTIVE);

                /* ###### START DEBUGGING BLOCK ###### */
                // Description:
                // dt_datetime_t Rtc1;
                // if (rtc_read_datetime(&Rtc1) != TRUE) {
                //     wd_error_handler(__FILE__, __LINE__);
                // }

                // log_usb_message("Taking a photo at %i:%i:%i %i/%i/%i\r\n", Rtc1.Time.second, Rtc1.Time.minute,
                //                 Rtc1.Time.hour, Rtc1.Date.day, Rtc1.Date.month, Rtc1.Date.year);

                // Description: Simulating the ESP turning on and taking a photo. When you turn the ESP on for real you
                // can delete this code
                // event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_EVENT_RUNNING);
                bpk_t DebugMessage;
                bpk_create_sp(&DebugMessage, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Message,
                              BPK_Code_Success, "Requesting to take a photo");
                wd_write_bpacket_maple(&DebugMessage);

                /* ####### END DEBUGGING BLOCK ####### */

