gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
    if (Bpacket->Request.val == BPK_REQ_TAKE_PHOTO) {

        /****** START CODE BLOCK ******/
        // Description: Testing this bit of code. Can delete if necessary
        uint8_t occured = FALSE;
        bpk_t debugMessage;
        if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_ON, EGT_ACTIVE) == FALSE) {
            bpk_create_sp(&debugMessage, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Message,
                          BPK_Code_Success, "Maple request but ESP is not on");
            wd_write_bpacket_maple(&debugMessage);
            occured = TRUE;
        }
        if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_READY, EGT_ACTIVE) == FALSE) {
            bpk_create_sp(&debugMessage, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Message,
                          BPK_Code_Success, "Maple request but ESP is not ready");
            wd_write_bpacket_maple(&debugMessage);
            occured = TRUE;
        }

        if (occured == TRUE) {
            return;
        }
        /****** END CODE BLOCK ******/

        /* Set the required event group bits */
        event_group_set_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_ACTIVE);
        event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_STM_REQUEST);
        event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_EVENT_RUNNING);

        return;
    }

    switch (Bpacket->Request.val) {

        case BPK_REQUEST_PING:;

            // Create response
            static uint8_t stmPingCode = 47;
            if (bpk_create(&BpkStmResponse, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Ping,
                           BPK_Code_Success, 1, &stmPingCode) != TRUE) {
                wd_error_handler(__FILE__, __LINE__);
                break;
            }

            // Send bpacket to Maple
            wd_write_bpacket_maple(&BpkStmResponse);

            break;

        case BPK_REQ_LIST_DIR:;

            /****** START CODE BLOCK ******/
            // Description: Debugging. Can delete whenever
            bpk_t DebugMessage;
            bpk_create_sp(&DebugMessage, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Message,
                          BPK_Code_Success, "STM ack Maple req list dir");
            wd_write_bpacket_maple(&DebugMessage);
            /****** END CODE BLOCK ******/

            bpk_create(&BpkStmResponse, BPK_Addr_Receive_Esp32, BPK_Addr_Send_Stm32, BPK_Req_List_Dir, BPK_Code_Execute,
                       0, NULL);
            wd_write_bpacket_esp(&BpkStmResponse);
            break;

        case BPK_REQ_SET_DATETIME:;

            // Extract the datetime
            dt_datetime_t Datetime;
            if (dt_datetime_init(&Datetime, Bpacket->Data.bytes[0], Bpacket->Data.bytes[1], Bpacket->Data.bytes[2],
                                 Bpacket->Data.bytes[3], Bpacket->Data.bytes[4],
                                 (((uint16_t)Bpacket->Data.bytes[5]) << 8) | Bpacket->Data.bytes[6]) != TRUE) {
                // TODO: Handle error
                break;
            }

            /* Update the RTC with the new datetime */
            if (rtc_write_datetime(&Datetime) != TRUE) {
                // TODO: Handle the error

                break;
            }

            bpk_create(&BpkStmResponse, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Req_Set_Datetime,
                       BPK_Code_Success, 0, NULL);
            wd_write_bpacket_maple(&BpkStmResponse);
            break;

        case BPK_REQ_SET_WATCHDOG_SETTINGS:;

            /* Extract the settings from the bpacket and convert them to structs */
            capture_time_t NewCaptureTimeSettings;
            camera_settings_t NewCamSettings;
            wd_utils_bpk_to_settings(Bpacket, &NewCaptureTimeSettings, &NewCamSettings);

            /* Write new settings to flash */
            if (wd_write_settings(&NewCaptureTimeSettings, &NewCamSettings) != TRUE) {
                wd_error_handler(__FILE__, __LINE__);
            }

            // Update the camera settings structs by reading the flash
            wd_read_settings(&gbl_CaptureTime, &lg_CameraSettings);

            /* Send success response */
            bpk_create(&BpkStmResponse, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Req_Set_Watchdog_Settings,
                       BPK_Code_Success, 0, NULL);
            wd_write_bpacket_maple(&BpkStmResponse);

            // Update the alarm time incase the alarm settings have changed
            event_group_set_bit(&gbl_EventsStm, EVENT_STM_RTC_UPDATE_ALARM, EGT_ACTIVE);

            break;

        case BPK_REQ_GET_WATCHDOG_SETTINGS:;

            /* Store current watchdog settings into bpacket and send to computer */
            uint8_t settingsData[WD_NUM_SETTINGS_BYTES];
            wd_utils_settings_to_array(settingsData, &gbl_CaptureTime, &lg_CameraSettings);

            /* Create bpacket and send to computer */
            bpk_create(&BpkStmResponse, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Req_Get_Watchdog_Settings,
                       BPK_Code_Success, WD_NUM_SETTINGS_BYTES, settingsData);
            wd_write_bpacket_maple(&BpkStmResponse);

            /* Maple requests the watchdog settings on startup. Currently the RTC gets sent automatically when
                it updates which most likely won't be when Maple connects so to ensure Maple always has the
                correct RTC alarm time, will also send it once here when Maple requests the watchdog settings */
            // TODO: Come up with a more elegant way to do this.
            dt_datetime_t AlarmTime;
            if (rtc_read_alarm_datetime(&AlarmTime, 0) != TRUE) {
                wd_error_handler(__FILE__, __LINE__);
            }

            uint8_t alarmData[7] = {
                AlarmTime.Time.second, AlarmTime.Time.minute,    AlarmTime.Time.hour,        AlarmTime.Date.day,
                AlarmTime.Date.month,  AlarmTime.Date.year >> 8, AlarmTime.Date.year & 0xFF,
            };

            bpk_t BpkNextAlarm;
            bpk_create(&BpkNextAlarm, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Req_Get_Rtc_Alarm,
                       BPK_Code_Success, 7, alarmData);
            wd_write_bpacket_maple(&BpkNextAlarm);

            break;

        case BPK_REQ_GET_TEMPERATURE:;

