gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
    CaptureTime->intervalSecond = (uint16_t)(flashRead[2] >> 48);
    CaptureTime->intervalMinute = (uint16_t)((flashRead[2] >> 32) & 0xFFFF);
    CaptureTime->intervalHour   = (uint16_t)((flashRead[2] >> 16) & 0xFFFF);
    CaptureTime->intervalDay    = (uint16_t)(flashRead[2] & 0xFFFF);

    CameraSettings->frameSize       = (uint8_t)((flashRead[3] >> 24) & 0xFF);
    CameraSettings->jpegCompression = (uint8_t)((flashRead[3] >> 16) & 0xFF);
    CameraSettings->flashEnabled    = (uint8_t)((flashRead[3] >> 8) & 0xFF);
}

uint8_t wd_calculate_next_alarm_time(dt_datetime_t* AlarmDatetime) {

    // Read the rtc time
    dt_datetime_t Rtc;
    if (rtc_read_datetime(&Rtc) != TRUE) {
        return FALSE;
    }

    // Set the date of the alarm to be the current date on the real time clock
    AlarmDatetime->Date.day   = Rtc.Date.day;
    AlarmDatetime->Date.month = Rtc.Date.month;
    AlarmDatetime->Date.year  = Rtc.Date.year;

    // Set the time of the alarm to be the start time
    if (dt_time_init(&AlarmDatetime->Time, gbl_CaptureTime.Start.Time.second, gbl_CaptureTime.Start.Time.minute,
                     gbl_CaptureTime.Start.Time.hour) != TRUE) {
        return FALSE;
    }

    /****** START CODE BLOCK ******/
    // Description: Debugging. Can delete whenever
    // log_usb_message("RTC Time: %i:%i:%i %i/%i/%i\r\n", Rtc.Time.second, Rtc.Time.minute, Rtc.Time.hour, Rtc.Date.day,
    //                 Rtc.Date.month, Rtc.Date.year);
    // // log_usb_message("RTC Time: %i:%i:%i\r\n", RtcTime.second, RtcTime.minute, RtcTime.hour);
    /****** END CODE BLOCK ******/

    /* Need to check whether the alarm time should actually be later than the start time */
    while (1) {

        // RTC time less than current alarm time so the alarm time is set correctly
        if (dt1_less_than_dt2(&Rtc, AlarmDatetime) == TRUE) {
            // log_usb_message("Breaking\r\n");
            break;
        }

        // Rtc time >= current alarm time. Need to advance the current alarm time by the
        // given time interval
        dt_datetime_add_time(AlarmDatetime, gbl_CaptureTime.intervalSecond, gbl_CaptureTime.intervalMinute,
                             gbl_CaptureTime.intervalHour, gbl_CaptureTime.intervalDay);

        // If the current alarm time is now > the end time then need to set the alarm time
        // to the start time and exit
        if (dt_t1_greater_than_t2(&AlarmDatetime->Time, &gbl_CaptureTime.End.Time) == TRUE) {

            // Increment the alarm time day
            dt_datetime_add_time(AlarmDatetime, 0, 0, 0, 1);

            if (dt_time_init(&AlarmDatetime->Time, gbl_CaptureTime.Start.Time.second, gbl_CaptureTime.Start.Time.minute,
                             gbl_CaptureTime.Start.Time.hour) != TRUE) {
                return FALSE;
            }

            break;
        }
    }

    return TRUE;
}